# Taps
tap "dopplerhq/cli"
tap "go-task/tap"
tap "stefanlogue/tools"

# CLI Tools & Utilities
brew "bat"
brew "carapace"
brew "fzf"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "zoxide"

# Languages & Runtimes
brew "go"
brew "node"
brew "uv"

# Task Runner
brew "go-task/tap/go-task"

# Infrastructure & DevOps
brew "dopplerhq/cli/doppler"
brew "kubernetes-cli"
brew "terraform"

# Dotfile Management
brew "chezmoi"

# Development Tools
cask "meteor"

# AI Tools
cask "codex"

# Fonts
cask "font-jetbrains-mono"
cask "font-monaspace"
